import { Component } from '@angular/core';
import { CommonModule } from '@angular/common';

@Component({
  selector: 'app-terms',
  standalone: true,
  imports: [CommonModule],
  template: `
    <div class="terms-conditions text-right pb-5 font-family-arabic" dir="rtl">
      <div class="container pb-5">
        <h1 class="h1 py-5 mb-3 text-center">الشروط والأحكام</h1>
        <div class="terms">
          <div>
            <p>الغرض من منصة ينفع : “ ينفع للوساطة في تقديم الخدمات عبر المنصة الالكترونية “ هي موقع إلكتروني ومنصة رقمي متخصصة في الوساطة الإلكترونية في عرض محتوى التدريب وعرض المحتويات والمصنفات الصوتية والمرئية التعليمية و التثقيفية سابقة التصوير</p>
            <p>تتيح المنصة للمتعلمين " الدارسين " ان يقوموا بالتعلم والاستفادة من المواد التعليمية والتثقيفية التي يقدمها المدربين " المحاضرين " ويعد كل منهم " مستخدم" للمنصة.</p>
            <p>خلال استخدام خدمات منصة ينفع يقبل المستخدم ويقر بما يلي: ان المعلومات الواردة في استمارة التسجيل صحيحة، بشرط ان تكون هذه المعلومات مطلوبة، وأن المستخدم هو المسؤول وحده عن أية خسائر قد تنشأ عن أية معلومات خاطئة او معلومات غير كافية وفي تلك الحالات يتم انهاء عضويته.</p>
            <p>ان المستخدم هو وحده المسؤول عن كافة الأفكار والآراء والبيانات الشخصية التي يذكرها داخل منصة ينفع، وكذلك مسئولا عن كافة الملفات التي يتم تحميلها اليها والمعلومات الشخصية المرسلة، وإن المنصة لن تكون مسؤولة بأي شكل من الأشكال عن تلك الملفات، أو عن الولوج الى أي خدمات مقدمة عبرها يكون غير مصرح به أو بأي طريقة أخرى غير المحددة بواسطتها، وعدم تغيير البرمجيات بأي طريقة، وتعويض منصة ينفع عن كافة الخسائر المادية والادبية</p>
            <p>في حالة عدم التزام المستخدم بالمواد المذكورة أعلاه لن تكون منصة ينفع مسؤولة عن أي أضرار قد تنشأ عن قراءة البيانات العائدة الى أي مستخدمين بواسطة أي أفراد غير مصرح لهم.</p>
            <p>يجب على المستخدم عدم إرسال أي رسائل تكون تهديدية، أو غير أخلاقية، أو عنصرية ومناقضة للقوانين المحلية والاتفاقيات الدولية.</p>
            <p>أي مراسلات أو عناوين أو أسماء مستعارة يجب ألا تكون مخالفة للوائح، و الآداب العامة، والسلوك الحسن ،والقوانين.</p>
            <p>يلتزم المستخدم بعدم مضايقة و/أو تهديد المستخدمين الآخرين، أو أي من موظفي خدمة العملاء التابعين لمنصة ينفع ، وعدم التصرف بطريقة تؤثر على استخدام الخدمات من قبل المستخدمين الآخرين، وعدم ارسال، طباعة، أو توزيع أو تعميم أية مواد لا أخلاقية، غير مناسبة وغير قانونية ومعلومات قد تسبب ضررا بأسماء أي أشخاص أو مؤسسات، أو الإعلان، أو البيع أو العرض بيع أي منتجات أو خدمات، أو المشاركة في أي أفعال ضارة مثل المسح، أو المنافسة أو الرسائل المتسلسلة، وعدم إرسال أي معلومات أو برامج قد تؤدي الى الضرر بالمعلومات أو البرمجيات على أجهزة المستخدمين الآخرين.</p>
            <p>كافة السجلات أو المواد التي يتم الحصول عليها بواسطة استخدام خدمات منصة ينفع تكون ضمن موافقة المستخدم، وسوف يكون المستخدم مسؤولا تماماً عن أي أضرار أو فقد المعلومات أو أي خسائر اخرى ناتجة عن ذلك للمستخدم، ولا يحق للمستخدم المطالبة بالتعويض عن أي خسائر تنشأ عن استخدام المنصة،</p>
            <p>يلتزم المستخدم بعدم استخدام خدمات المنصة لأي اغراض تجارية أو إعلانية بدون الحصول على موافقة منصة ينفع.</p>
            <p>المستخدم مسؤول عن كافة أنواع التصرفات التي يتم القيام بها تحت إسم "المستخدم".</p>
            <p>يتعين على المستخدمين دفع رسوم الخدمة التي تم طلبها مسبقا ، وكل الحسابات على المنصة هي حسابات شخصية ولا يجوز مشاركتها او نقلها لأي شخص آخر ايا كان مهما كانت درجة قرابته.<br>ويجب الحرص على عدم استخدام منصة ينفع لأغراض غير قانونية، وعدم ارتكاب أي تصرفات مخالفة على المنصة او فيما يخص المحتوى عليها، وعدم استخدامها للقيام بأي انشطة تجارية وعدم نسخ أي محتوى، لإعادة النشر بشكل مطبوع او عبر الانترنت، أو لصالح او مع أي غرض تجاري او غرض اخر او قصد لا يتفق بنية حسنة مع غرض إنشاء منصة ينفع ، وعدم محاولة الحصول على حرية دخول غير مصرح بها الى انظمة كمبيوتر الاخرين من او عن طريق المنصة وعدم التدخل في استخدام شخص آخر أو جهات أخرى للمنصة  وعدم تحميل او نقل الفيروسات او الملفات الضارة والتخريبية او التدميرية الاخرى، و/او عدم تعطيل، التدخل في او حتى التسبب في ضرر أو مخالفة أمن المنصة، او أي خدمات، البرمجيات او الأجهزة المرتبطة بالنظام, الحسابات، كلمات السر، الخوادم او الشبكات المرتبطة بالمنصة.</p>
            <p>يتعين على كافة المستخدمين من القصر (عموما تحت 18 سنة) الحصول على تصريح من ولي أمرهم، ويتم الإشراف عليهم مباشرة بواسطة ولي امرهم او الاب /الام عند استخدام منصة ينفع.</p>
            <p>إذا كنت قاصر، يتعين على ولي أمرك/ والدك قراءة هذه الاتفاقية والاطلاع عليها قبل قيامك باستخدام منصة ينفع.</p>
            <p>أي معلومات تقوم بإرسالها أو نشرها على منصة ينفع سوف تعتبر غير سرية وغير شخصية. ولن يكون على منصة ينفع أي التزامات فيما يخص هذه المعلومات وسوف يكون للمنصة واي شخص نقوم بتعيينه الحرية لنسخ وتصحيح وتوزيع وتضمين أو أي استخدام خلاف ذلك لهذه المعلومات وكافة البيانات والصور والاصوات والنصوص والاشياء الاخرى المشمولة فيه لأي ولكافة الأغراض التجارية وغير التجارية.</p>
            <p>يحظر عليك نشر وتحميل أو ارسال إلى أو من منصة ينفع على الشبكة أي من المواد التالية:</p>
            <p>تنتهك أي قانون محلي، وطني او دولي معمول به.</p>
            <p>غير مشروعة أو احتيالية تصل الى حد الاعلان غير المصرح به أو تحتوي على فيروسات أو أي برامج اخرى ضارة.</p>
            <p>لا يجوز لك إساءة استخدام منصة ينفع (بما في ذلك القرصنة) أي تعليقات أو ملاحظات يضعها المستخدم على المنصة يجب ألا: تحتوي على أي مواد تشهيرية، خليعة او مخالفة أو تعزز العنف او التمييز تنتهك حقوق الملكية الفكرية لشخص اخر أو تنتهك أي واجب قانوني تجاه طرف ثالث (مثل واجب السرية) أو تعزز النشاط غير القانوني او تخترق خصوصية الآخرين أو تقدم انطباعا أنها صادرة عنها أو يتم استخدامها لتقمص شخصية شخص آخر أو تقديم معلومات خاطئة عن ارتباطك بشخص آخر إن التصرفات المحظورة الواردة في الفقرات اعلاه غير حصرية.</p>
            <p>سوف تقوم بتعويض منصة ينفع عن كافة النفقات والأضرار التي يتحملها كنتيجة لانتهاكك لأي من تلك القيود.</p>
            <p>سوف تقوم منصة ينفع بالتعاون بالكامل مع أي جهات تنفيذ القانون أو قرارات المحكمة التي تطلب منا او توجهنا للتصريح عن هوية أو موقع أي شخص يقوم بنشر أي مواد بمخالفة الفقرات المذكورة أعلاه.</p>
            <p>يجوز ان تقوم منصة ينفع بشكل مؤقت بتوقيف او التوقف تماما عن تشغيل النظام في أي وقت ولن يكون عليها أية مسؤوليات تجاه المستخدمين او أي طرف ثالث بسبب التوقيف المؤقت او التوقف الكامل لتشغيل النظام.</p>
            <p>سوف يتم عرض اسم المستخدم واعتماده بعد تعبئة بيانات النموذج الذي سيتم تقديمه الى المستخدمين بواسطة منصة ينفع.</p>
            <p>لا تضمن منصة ينفع أن خدماتها سوف يتم تقديمها في الوقت المحدد بطريقة آمنة تامة، وإن النتائج التي سيتم الحصول عليها من الخدمات سوف تكون صحيحة وموثوق فيها، وان نوعية الخدمات سوف ترقى إلى مستوى التوقعات.</p>
            <p>يحق لمنصة ينفع ان تقوم بحذف كافة أو بعض الملفات والرسائل التي يتم تقديمها بواسطة الاعضاء أثناء استخدام الخدمات لبعض الوقت وذلك خلال الفترات التي تعتبر مناسبة بواسطتها ولن تكون المنصة مسؤولة عن إجراءات الحذف.</p>
            <p>يجوز أن تقوم منصة ينفع بأي تغييرات على تنفيذ هذه الاتفاقية وتعديل المواد القائمة او اضافة مواد جديدة لغرض الالتزام بأي التزامات فنية وتشريعات يتم إصدارها في المستقبل.</p>
            <p>يجوز أن تقوم منصة ينفع بتغيير الخدمات التي لا تتطلب عضوية الى شكل يتطلب عضوية.</p>
            <p>يجوز ان تقوم منصة ينفع بتقديم خدمات اضافية وتغيير بعض الخدمات جزئيا او بالكامل او تحويلها إلى خدمة مدفوعة.</p>
            <p>يجوز أن تكون منصة ينفع غير متاحة في بعض الأوقات للسماح بعمليات الصيانة والتحديث وبالرغم من أننا سوف نسعى لإبلاغ المستخدمين مسبقا بعدم توفر أي خدمة مذكورة، إلا أن ذلك لا يمكن ضمانه و نحتفظ بحق تعديل او سحب الخدمة في أي وقت.</p>
            <p>تتم الموافقة على التعليقات المرسلة من المستخدمين وفق المعايير التالية:</p>
            <p>العلاقة المباشرة: يجب أن يكون الشخص صاحب التعليق قد اختبر الخدمة مباشرة من خلال المنصة.</p>
            <p>المحتوى المقبول للتعليق: منصة ينفع غير ملزمة بقبول أي من التعليقات التي يتم إرسالها عن طريق المستخدمين، ومن بعض الأسباب التي يمكن ان نرفض نشر التعليقات بسببها هي كالآتي:</p>
            <p>التعليقات التي تحتوي على لهجة هجومية، إباحية، عنصرية ، لغة الكراهية ، كلها أمـور لا يمكننا نشرها على منصة ينفع.</p>
            <p>تعليقات ليس لها علاقة بموضوع تقييم منصة ينفع.</p>
            <p>التعليقات التي تتضمن التمييز القائم على الـدين، العـرق، الجنس، العمر، الحالة الزوجية أو الإعاقة الجسدية او الفكرية.</p>
            <p>أي محتوى له دلالات أو إشارات تخالف تقاليد المجتمع، أو تدعو الى توجه غير قانوني.</p>
            <p>تضارب المصالح: حيث لا يُسـمح لمزودي الخدمات المنافسين لمنصة ينفع وضع أي تعليقات سلبية. (أي مخالفات بهذا الصدد، يمكن أن تؤدي إلى إزالة دائمة لها من المنصة).</p>
            <p>الادعاءات المتعلقة بمخالفة القوانين.</p>
            <p>التعليقات التي تعكس معلومات قديمة وغير نافذة.</p>
            <p>أصحاب التعليقات لا يمثلون رأي منصة ينفع على الإطلاق ولا الشركة المالكة الرئيسية، ولا أي من الشركات أو المؤسسات التابعة.</p>
            <p>منصة ينفع غير مسؤولة عن أي التزامات أو مطالبات أو خسائر ناتجة عن أي من التعليقات المنشورة أو أي من المحتوى الموجود على المنصة.</p>
            <p>جميع البرامج التدريبية المسجلة وهي ملك او بالمشاركة مع لمنصة ينفع ولا يجوز نسخها، او بيعها، أو تصويرها أو نشرها لشخص اخر.</p>
            <p>في حال اشتراكك في إحدى الدورات التدريبية الإلكترونية لدى منصة ينفع فأنت توافق على الشروط والأحكام التالية:</p>
            <p>توافق على سياسة الإرجاع المعتمدة لدى منصة ينفع</p>
            <p>لا يجوز لك نسخ أو بيع أي برنامج تدريبي لدى منصة ينفع.</p>
            <p>لا يجوز لك طلب أي تعديل على أي دورة تدريبية.</p>
            <p><strong>الاتصالات الالكترونية:</strong></p>
            <p>عندما تزور موقع منصة ينفع، أو ترسل رسائل بريد إلكتروني إلينا، أو ترسل لنا رسالة، أو تتواصل معنا بطريقة أخرى، فأنت تتواصل معنا إلكترونيًا ، وبالتالي فإنك توافق على تلقي مراسلاتنا إلكترونيًا في المقابل و سنتواصل معك عبر البريد الإلكتروني المعتمد للمنصة وهو : <a href="mailto:help&#64;yanfaa.ddns.net">help&#64;yanfaa.ddns.net</a> أو عن طريق الرسائل أو نشر الإشعارات على هذا الموقع.</p>
            <p>أنت توافق على أن جميع الاتفاقيات والإشعارات والافصاحات وغيرها من المراسلات التي نقدمها إليك إلكترونياً تفي بأي شرط قانوني بأن تكون هذه المراسلات مكتوبة.</p>
            <p>أنت توافق على تجديد الاشتراك تلقائيا وفي حال طلب إلغاء الاشتراك يجب ارسال ايميل بذلك الى الايميلات الرسمية المذكورة أعلاه.</p>
            <p><strong>وصف المنتج:</strong></p>
            <p>تقدم منصة ينفع شهادات إكمال، للبرامج المسجلة (الدورات المسجلة) تثبت من خلالها المنصة إكمال المتدرب لمحتوى الدورة وهذه الشهادات لا تمثل أي جهة خارجية.</p>
            <p><strong>تقديم الدورات والبرامج التدريبية:</strong></p>
            <p>تخلي المنصة مسؤوليتها من أي تقصير أو تأخير فيما يخص عرض المحتوى التدريبي عن بعد أو إصدار الشهادات.</p>
            <p><strong>إخلاء المسؤولية من الضمانات، وتقييد المسؤولية والتعويض:</strong></p>
            <p>منصة ينفع وجميع المعلومات، والمحتوى، والمواد، والمنتجات (بما في ذلك البرامج) والخدمات المدرجة عليها أو غير ذلك من الأدوات المتاحة لك من خلال موقعها الإلكتروني هي مسؤولية المدربين “ المحاضرين “ وتتوافر “كما هي” و “حسب توفرها” وتقع مسؤوليتها على المستخدمين.</p>
            <p>لا تقدم منصة ينفع أي تعهدات أو ضمانات من أي نوع، صريحة أو ضمنية، فيما يتعلق بتشغيل المنصة، أو المعلومات، أو المحتوى، أو المواد، أو المنتجات (بما في ذلك البرامج) أو الخدمات المتضمنة في المنصة.</p>
            <p>أنت توافق صراحة على أن استخدامك لهذا الموقع منصة ينفع يقع على مسؤوليتك وحدك.</p>
            <p>لا تضمن منصة ينفع أن المعلومات، أو المحتوى، أو المواد، أو المنتجات (بما في ذلك الدورات) أو الخدمات المدرجة على أو بخلاف ذلك، والتي يتم توفيرها لك من خلال هذا الموقع أو البريد الإلكتروني المرسل من موقع المنصة خالية من الفيروسات أو مكونات ضارة أخرى.</p>
            <p>لن تكون منصة ينفع مسؤولة عن أي أضرار من أي نوع تنشأ عن استخدامها</p>
            <p><strong>الاشتراكات والغائها وسياسية الإسترجاع:</strong></p>
            <p>الاشتراكات في المنصة غير قابلة للإسترجاع.</p>
            <p>جميع الاشتراكات في المنصة هي اشتراكات شخصية ولا يجوز نشرها او مشاركتها مع الغير، وفي حالة حدوث ذلك ستعرض حسابك للغلق النهائي ولن تستطيع الحصول على خدمات المنصة مرة اخرى ايا كانت مدة اشتراكك. </p>
            <p>جميع الاشتراكات من داخل جمهورية مصر العربية سارية فقط في جمهورية مصر العربية</p>
            <p>سيظل الاشتراك مستمر وخاضع للتجديد التلقائي طبقا لخطة الاشتراك التي يختارها المستخدم " سواء شهرية او سنوية او نصف سنوية أو غيرها " حتى يقوم المستخدم بإلغاء التجديد التلقائي. وقد تتغير الاسعار وخطط الاشتراك طبقا للبلد والعملة او عوامل اخرى.</p>
            <p>اذا كنت تود ان تلغي اشتراكك فيجب عليك أن تلغي التجديد التلقائي قبل ميعاد التجديد المقبل. اذا تم التجديد فلن تكون قادرا على استرجاع المبلغ المدفوع ولكنك ستحصل على خدمات المنصة حتى ميعاد انتهاء الاشتراك.</p>
          </div>
        </div>
      </div>
    </div>
  `
})
export class TermsComponent {}
